gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Boîtier de contrôle pour le ksoloti        
// Ce boîtier envoie des données DMX vers le récepteur ksoloti        
// Il gère les capteurs Sharp IR, les faders, les boutons et l'encodeur rotatif        
// Il gère également l'affichage sur l'écran TM1637        
// Il gère également le ruban WS2812B        
// L'Onirigun est maintenant géré par le récepteur Ksoloti        
// Il gère également le dimmer RGB        
// Il gère également la transposition du pitch        
// Il gère également les presets        
// Il communique avec le récepteur ksoloti via ESP-NOW         
        
// adresse mac de l'onirigun : 68:C6:3A:FD:37:17 (géré par le récepteur Ksoloti)        
        
#define VERSION 1757978703 // Version basée sur timestamp Unix        
/*        
// Contrôleur interactif ESP32 avec capteurs Sharp IR        
// Utilise ESP-NOW pour transmettre les données DMX        
// Fréquence d'émission : 50Hz        
// Canal DMX 102 : valeur du capteur Sharp IR (0-255)        
*/        
        
#include <Arduino.h>        
#include <esp_now.h>        
#include <WiFi.h>        
#include <ESP32Encoder.h>        
#include <Wire.h>        
#include <TM1637Display.h>        
#include <driver/adc.h>  // Pour les constantes ADC de l'ESP32        
#include <FastLED.h>     // Pour le ruban WS2812B        
#include <WebServer.h>   // Pour le serveur web
#include <LittleFS.h>    // Pour le système de fichiers
#include <ArduinoJson.h> // Pour le format JSON
#include <WiFiManager.h> // Pour la gestion automatique du WiFi
// mDNS supprimé (non nécessaire en mode AP)
#include "ota_update.h"  // Pour la fonctionnalité OTA
        
#define CONTROL_TEST 0 // 1 pour tester les entrées, 0 pour le fonctionnement normal        
        
// Définitions pour les capteurs Sharp IR        
#define DIST_SENSOR_1_PIN 35    // GPIO35 - Premier capteur Sharp IR (changé pour plus de stabilité)        
#define DIST_SENSOR_2_PIN 36    // GPIO36 - Deuxième capteur Sharp IR        
        
// Définitions pour les faders analogiques        
#define FADER_1_PIN 32    // GPIO32 - Premier fader        
#define FADER_2_PIN 33    // GPIO33 - Deuxième fader (changé pour éviter le conflit)        
#define FADER_3_PIN 34    // GPIO34 - Troisième fader        
        
// Définitions pour l'encodeur rotatif KY-040        
#define ENCODER_A_PIN 26    // GPIO26 - Pin A de l'encodeur        
#define ENCODER_B_PIN 27    // GPIO27 - Pin B de l'encodeur        
#define ENCODER_BUTTON_PIN 25  // GPIO25 - Bouton de l'encodeur        
        
// Définitions pour l'afficheur TM1637        
#define TM1637_CLK_PIN 18    // GPIO18 - CLK de l'afficheur        
#define TM1637_DIO_PIN 19    // GPIO19 - DIO de l'afficheur        
        
// Définitions pour les boutons push (remplacement du PCF8574)        
#define BUTTON_1_PIN 22    // GPIO22 - Premier bouton (libéré du PCF8574)        
#define BUTTON_2_PIN 21    // GPIO21 - Deuxième bouton (libéré du PCF8574)        
#define BUTTON_3_PIN 23    // GPIO23 - Troisième bouton (nouveau GPIO)        
        
// Définitions pour le ruban WS2812B        
#define LED_STRIP_PIN 4    // GPIO4 - Signal DATA du WS2812B        
const int NUM_LEDS = 144;         // Nombre de LEDs dans le ruban (ajustable)        
#define BRIGHTNESS 64      // Luminosité (0-255)        
        
// Configuration ESP-NOW        
#define EMISSION_FREQUENCY 50  // Hz (20ms entre chaque émission)        
#define DMX_CHANNEL_IR_1 102  // Canal DMX pour le premier capteur Sharp IR        
#define DMX_CHANNEL_IR_2 103  // Canal DMX pour le deuxième capteur Sharp IR        
#define MAX_DISTANCE_CM 80  // Distance maximale en cm pour Sharp IR (80cm = 0, 4cm = 255)        
#define MIN_DISTANCE_CM 4   // Distance minimale en cm pour Sharp IR        
        
// Configuration des presets        
#define PRESET_SIZE 40  // Nombre de paramètres par preset (40 au lieu de 38)        
#define MAX_PRESETS 10  // Nombre maximum de presets        
#define MAX_WEB_PRESETS 8  // Nombre maximum de presets web (S1-S8 et L1-L8)        
        
// Configuration des trigs        
#define TRIG_LENGTH 5   // Durée des trigs en nombre de paquets DMX        
        
// Configuration du dimmer RGB        
#define DIMMER_SPEED 0.01 // Vitesse de l'inertie du dimmer (0.0-1.0, plus petit = plus lent)        
        
// Configuration du serveur web
#define WEB_SERVER_PORT 80
#define MDNS_HOSTNAME "ksolotikontrol"
#define WIFI_TIMEOUT_MS 30000  // 30 secondes de timeout pour la connexion WiFi
        
// Structure pour un paramètre        
typedef struct {        
  const char* name;     // Nom du paramètre        
  uint16_t dmxChannel;  // Canal DMX (1-512)        
  uint8_t value;        // Valeur actuelle (0-255)        
  uint8_t defaultValue; // Valeur par défaut        
} Parameter;        
        
// Structure pour un preset complet        
typedef struct {        
  char name[16];        // Nom du preset        
  uint8_t values[PRESET_SIZE]; // Valeurs des paramètres        
} Preset;        
        
// Structure pour un preset web        
typedef struct {        
  char name[32];        
  uint8_t values[27];  // 27 paramètres (0-20: audio principaux, 21-23: filter, 24-26: rgb1)        
  int8_t octave;       // Octave web (-12 à +12)        
  uint8_t assignments[4]; // Assignations physiques: IR1, IR2, Fader2, Fader3        
} WebPreset;        
        
// ============================================================================        
// DÉCLARATIONS DES FONCTIONS DE L'INTERFACE WEB        
// ============================================================================        
        
// Fonctions de l'interface web        
void setupWebInterface();        
void setupWebInterfaceESP(); // Version pour point d'accès ESP
void optimizeAPMode(); // Optimisations pour mode Access Point
void setupWebRoutes();        

// Fonctions de debug web
void addDebugMessage(String message);
void handleGetDebugMessages();        
        
void handleGetParameters();        
void handleUpdateParameter();        
void handleGetAssignments();        
void handleUpdateAssignments();        
void handleSaveWebPreset();        
void handleLoadWebPreset();        
void handleListWebPresets();        
void handleOctave();        
void handleExportPresets();
void handleImportPresets();
void handleChangeWifi(); // Fonction pour changer le réseau WiFi
void initializeEmptyWebPresets();
void handleNotFound();        
void saveWebPresets();        
void loadWebPresets();        
void saveWebAssignments();        
void loadWebAssignments();        
void saveWebStateToPreset0();        
void loadWebStateFromPreset0();        
void saveWebStateToPreset0();        
void resetWebParameters();        
void handleWebPhysicalControls();        
void loadWebPresetUnified(int presetIndex);        
        
// Création des objets        
TM1637Display display(TM1637_CLK_PIN, TM1637_DIO_PIN);        
ESP32Encoder encoder;        

