gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Objet pour la fonctionnalité OTA        
OTAUpdate otaUpdate;        

// Objets pour l'interface web
WebServer webServer(WEB_SERVER_PORT);
WiFiManager wifiManager;
        
// Variables pour l'interface web        
bool webModeActive = false;           // True si le preset 0 (web) est actif        
uint8_t webAssignments[4] = {0, 0, 0, 0}; // IR1, IR2, Fader2, Fader3 (0 = OFF, 1-21 = paramètre)        
uint8_t lastWebPreset = 0;            // Dernier preset web chargé        
uint8_t webPresetCount = 0;           // Nombre de presets web sauvegardés        
int8_t webOctave = 0;                 // Octave web (indépendante de la transposition)        

// Variables pour les modes de fonctionnement
enum OperatingMode {
  MODE_STANDALONE = 0,    // Pas d'interface web
  MODE_WIFI_LOCAL = 1,    // WiFi local avec WiFiManager
  MODE_WIFI_ESP = 2       // Point d'accès ESP
};
OperatingMode currentOperatingMode = MODE_STANDALONE; // Mode par défaut

// Variables pour le système de debug web
String debugMessages = "";  // Buffer pour les messages de debug
const int MAX_DEBUG_MESSAGES = 50;  // Nombre maximum de messages à conserver        

// Variables pour l'uniformisation des presets        
uint8_t selectedWebPreset = 1;        // Preset web sélectionné pour navigation (1-8)        
bool isDisplayingLoad = false;        // True pendant l'affichage "LOAd"        
unsigned long loadDisplayStartTime = 0; // Temps de début d'affichage "LOAd"        
unsigned long lastPhysicalPresetChange = 0; // Timestamp du dernier changement physique        
        
WebPreset webPresets[MAX_WEB_PRESETS];        
        
// Définition du tableau de LEDs pour FastLED        
CRGB leds[NUM_LEDS];        
        
// Définition des 37 paramètres du theremin (24 existants + 13 nouveaux)        
Parameter parameters[PRESET_SIZE] = {        
  // Paramètres existants (1-24)        
  {"autopan_depth", 101, 0, 0},        
  {"pitch", 102, 0, 0},        
  {"vibrato_speed", 103, 0, 0},        
  {"vibrato_depth", 104, 0, 0},        
  {"delay_time", 105, 0, 0},        
  {"delay_feedback", 106, 0, 0},        
  {"osc_waveform", 107, 0, 0},        
  {"gate_threshold", 108, 0, 0},        
  {"portamento_time", 109, 0, 0},        
  {"scale", 110, 0, 0},        
  {"octave_low_high", 111, 0, 0},        
  {"osc2_volume", 112, 0, 0},        
  {"osc2_pitch_offset", 113, 0, 0},        
  {"autopan_frequency", 114, 0, 0},        
  {"scale_tonic", 115, 0, 0},        
  {"volume_drums", 116, 0, 0},        
  {"trig_kick", 117, 0, 0},        
  {"trig_snare", 118, 0, 0},        
  {"trig_hh", 119, 0, 0},        
  {"master_volume", 120, 0, 0},        
  {"filter_on_off", 121, 0, 0},        
  {"filter_cutoff", 122, 0, 0},        
  {"filter_reso", 123, 0, 0},        
  {"filter_type", 124, 0, 0},        
          
  // Nouveaux paramètres (25-37)        
  {"ir1_target_param", 125, 1, 1},        // 1 - index du paramètre contrôlé par IR1 (1 = pitch)        
  {"ir2_target_param", 126, 3, 3},        // 2 - index du paramètre contrôlé par IR2 (3 = vibrato_depth)        
  {"fader1_target_param", 127, 2, 2},     // 3 - index du paramètre contrôlé par fader1 (2 = vibrato_speed)        
  {"fader2_target_param", 128, 4, 4},     // 4 - index du paramètre contrôlé par fader2 (4 = delay_time)        
  {"fader3_target_param", 129, 5, 5},     // 5 - index du paramètre contrôlé par fader3 (5 = delay_feedback)        
  {"button3_target_param", 130, 18, 18},  // 6 - index du paramètre contrôlé par bouton3 (18 = trig_hh)        
  {"button3_released_value", 131, 0, 0},  // 7 - valeur quand bouton3 est relevé        
  {"button3_pressed_value", 132, 5, 5},   // 8 - valeur quand bouton3 est pressé        
  {"rgb1_red", 133, 255, 255},            // 9 - première valeur RGB (rouge)        
  {"rgb1_green", 134, 0, 0},              // 10 - première valeur RGB (vert)        
  {"rgb1_blue", 135, 0, 0},               // 11 - première valeur RGB (bleu)        
  {"rgb2_red", 136, 0, 0},                // 12 - deuxième valeur RGB (rouge)        
  {"rgb2_green", 137, 255, 255},          // 13 - deuxième valeur RGB (vert)        
  {"rgb2_blue", 138, 0, 0},               // 14 - deuxième valeur RGB (bleu)        
  {"dimmer1_source", 139, 0, 0},          // 15 - source du dimmer1 (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)        
  {"dimmer2_source", 140, 1, 1}           // 16 - source du dimmer2 (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)        
};        
        
// Tableau des presets        
Preset presets[MAX_PRESETS];        
        
// Tableau des valeurs DMX (512 canaux)        
uint8_t dmxValues[512];        
        
// Structure pour les paquets DMX        
typedef struct struct_dmx_packet        
{        
  uint8_t blockNumber; // on divise les 512 adresses en 4 blocs de 128 adresses        
  uint8_t dmxvalues[128];        
} struct_dmx_packet;        
        
struct_dmx_packet outgoingDMXPacket;        
        
// Adresse MAC du récepteur ESP8266        
uint8_t receiverAddress[] = {0xB4, 0xBF, 0xE9, 0x09, 0xFA, 0x00}; // nouvelle carte récepteur Ksoloti        
        
esp_now_peer_info_t peerInfo; // Configuration du peer récepteur ESP8266        
        
// Variables de timing        
unsigned long lastEmissionTime = 0;        
const unsigned long EMISSION_INTERVAL = 1000 / EMISSION_FREQUENCY; // 20ms pour 50Hz        
        
// Variables pour les boutons PCF8574        
bool buttonStates[3] = {false, false, false};        
bool lastButtonStates[3] = {false, false, false};        
unsigned long lastButtonPress[3] = {0, 0, 0};        
const unsigned long BUTTON_DEBOUNCE = 100; // 200ms de debounce        
        
// Variables pour les interruptions de boutons        
volatile bool buttonInterruptFlags[3] = {false, false, false};        
volatile unsigned long buttonInterruptTimes[3] = {0, 0, 0};        

// Variables pour les nouvelles fonctions des boutons
bool muteMode = false;  // Mode mute activé/désactivé (bouton 3 clic court)
bool button3LongPress = false;  // Clic long bouton 3 pour delay feedback max
unsigned long button3PressStartTime = 0;  // Temps de début d'appui bouton 3
const unsigned long LONG_PRESS_DURATION = 800;  // Durée pour considérer un clic long (ms)

// Variables pour le debounce des boutons 1 et 2
unsigned long lastButton1Press = 0;
unsigned long lastButton2Press = 0;
const unsigned long BUTTON_DEBOUNCE_TIME = 200;  // 200ms de debounce
        
