gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
//                  |pandepth        |time           |porta          |osc2off       |kick       |master        |type             |fader2        |b3_pressed     /r2             /dim2        
//                       |pitch          |delFB          |scale         |autofreq       |snare      |filter         |ir1             |fader3        /r1             /g2        
//                           |vibraspeed     |osc            |octlow        |tonic          |hh         |cutoff         |ir2            |button3        /g1             /b2        
//                               |vibradepth     |gate           |osc2vol       |drums         |master     |reso            |fader1         |b3_rel         /b1             /dim1        
        
        
      // Preset 0 - WEB MODE (pas d'assignations physiques)        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,255,  0,  50,255,0,  50,  0,  0);        
  savePreset(0, "WEB MODE");        
        
       
          
  Serial.println("Presets initialisés");        
}        
// Fonctions d'interruption pour les boutons        
void IRAM_ATTR button1ISR() {        
  unsigned long interruptTime = millis();        
  if (interruptTime - buttonInterruptTimes[0] > BUTTON_DEBOUNCE) {        
    buttonInterruptFlags[0] = true;        
    buttonInterruptTimes[0] = interruptTime;        
  }        
}        
        
void IRAM_ATTR button2ISR() {        
  unsigned long interruptTime = millis();        
  if (interruptTime - buttonInterruptTimes[1] > BUTTON_DEBOUNCE) {        
    buttonInterruptFlags[1] = true;        
    buttonInterruptTimes[1] = interruptTime;        
  }        
}        
        
void IRAM_ATTR button3ISR() {        
  unsigned long interruptTime = millis();        
  if (interruptTime - buttonInterruptTimes[2] > BUTTON_DEBOUNCE) {        
    buttonInterruptFlags[2] = true;        
    buttonInterruptTimes[2] = interruptTime;        
  }        
}        
        
// Fonction d'initialisation des interruptions        
void initializeButtonInterrupts() {        
  // Configuration des pins en INPUT_PULLUP        
  pinMode(BUTTON_1_PIN, INPUT_PULLUP);        
  pinMode(BUTTON_2_PIN, INPUT_PULLUP);        
  pinMode(BUTTON_3_PIN, INPUT_PULLUP);        
          
  // Attacher seulement l'interruption pour le bouton 3 (boutons 1 et 2 gérés par polling)        
  // attachInterrupt(digitalPinToInterrupt(BUTTON_1_PIN), button1ISR, FALLING);        
  // attachInterrupt(digitalPinToInterrupt(BUTTON_2_PIN), button2ISR, FALLING);        
  attachInterrupt(digitalPinToInterrupt(BUTTON_3_PIN), button3ISR, FALLING);        
          
  Serial.println("Interruptions de boutons configurées");        
}        
        
// Fonction d'initialisation de l'interface utilisateur        
void initializeUserInterface() {        
         
  // Configuration des boutons push avec interruptions        
  initializeButtonInterrupts();        
          
  // Initialisation du ruban WS2812B        
  FastLED.addLeds<WS2812B, LED_STRIP_PIN, GRB>(leds, NUM_LEDS);        
  FastLED.setBrightness(BRIGHTNESS);        
  FastLED.clear();        
  FastLED.show();        
          
  // Initialisation de l'encodeur KY-040        
  encoder.attachHalfQuad(ENCODER_A_PIN, ENCODER_B_PIN);        
  encoder.setCount(0);        
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);        
          
  // Initialisation de l'afficheur TM1637        
  display.setBrightness(7); // 0-7        
  display.clear();        
         
    // Configuration ADC pour une meilleure résolution        
    analogReadResolution(12); // 12 bits (0-4095)        
        
  Serial.println("Interface utilisateur initialisée");        
}        
        
// Fonction pour lire les capteurs Sharp IR avec stabilisation - NOUVELLE STRATÉGIE        
void readSharpIRSensors() {        
  // Lecture stabilisée du premier capteur Sharp IR        
  int stabilizedValue1 = readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1);        
  uint8_t sharpIRValue1 = stabilizedValue1 / 16;        
  setParameter("pitch", sharpIRValue1);        
          
  // Lecture stabilisée du deuxième capteur Sharp IR        
  int stabilizedValue2 = readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2);        
  uint8_t sharpIRValue2 = stabilizedValue2 / 16;        
  setParameter("vibrato_speed", sharpIRValue2);        
          
  // Debug minimal        
  Serial.print("IR1: ");        
  Serial.print(stabilizedValue1);        
  Serial.print(" -> ");        
  Serial.print(sharpIRValue1);        
  Serial.print(" | IR2: ");        
  Serial.print(stabilizedValue2);        
  Serial.print(" -> ");        
  Serial.println(sharpIRValue2);        
}        
        
// Fonction pour lire les faders        
void readFaders() {        
  faderValues[0] = analogRead(FADER_1_PIN) / 16; // 0-4095 -> 0-255        
  faderValues[1] = analogRead(FADER_2_PIN) / 16;        
  faderValues[2] = analogRead(FADER_3_PIN) / 16;        
          
  // Mise à jour des paramètres selon les faders        
  if (faderValues[0] != lastFaderValues[0]) {        
    setParameter("filter_cutoff", faderValues[0]);        
    lastFaderValues[0] = faderValues[0];        
  }        
          
  if (faderValues[1] != lastFaderValues[1]) {        
    setParameter("filter_reso", faderValues[1]);        
    lastFaderValues[1] = faderValues[1];        
  }        
          
  if (faderValues[2] != lastFaderValues[2]) {        
    setParameter("delay_time", faderValues[2]);        
    lastFaderValues[2] = faderValues[2];        
  }        
}        
        
// Fonction pour gérer les boutons push        
void handleButtons() {        
  // Lecture des boutons        
  bool button1State = !digitalRead(BUTTON_1_PIN); // Inversé car INPUT_PULLUP        
  bool button2State = !digitalRead(BUTTON_2_PIN);        
  bool button3State = !digitalRead(BUTTON_3_PIN);        
          
  // Bouton 1 - Décrémenter preset avec debounce
  if (button1State && !lastButtonStates[0] && (millis() - lastButton1Press > BUTTON_DEBOUNCE_TIME)) {
    if (selectedWebPreset > 1) {
      selectedWebPreset--;
    } else {
      selectedWebPreset = 8; // Boucler vers P8 quand on est en P1
    }
    loadWebPresetUnified(selectedWebPreset - 1); // Convertir 1-8 en 0-7
    Serial.print("Bouton 1 - Web preset descendu et chargé: P");
    Serial.println(selectedWebPreset);
    displayUnified();
    lastButton1Press = millis();
  }
  
  // Bouton 2 - Incrémenter preset avec debounce
  if (button2State && !lastButtonStates[1] && (millis() - lastButton2Press > BUTTON_DEBOUNCE_TIME)) {
    if (selectedWebPreset < 8) {
      selectedWebPreset++;
    } else {
      selectedWebPreset = 1; // Boucler vers P1 quand on est en P8
    }
    loadWebPresetUnified(selectedWebPreset - 1); // Convertir 1-8 en 0-7
    Serial.print("Bouton 2 - Web preset monté et chargé: P");
    Serial.println(selectedWebPreset);
    displayUnified();
    lastButton2Press = millis();
  }
          
