gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Bouton 3 - Gestion mute/unmute et delay feedback        
  // Détecter le début d'un appui (front montant)
  if (button3State && !lastButtonStates[2]) {        
    button3PressStartTime = millis();        
    button3LongPress = false;
  }        
  
  // Détecter la fin d'un appui (front descendant)
  if (!button3State && lastButtonStates[2]) {        
    unsigned long pressDuration = millis() - button3PressStartTime;        
    
    if (pressDuration < LONG_PRESS_DURATION) {        
      // Clic court : toggle mute/unmute        
      muteMode = !muteMode;        
      Serial.print("Bouton 3 - Mode mute ");        
      Serial.println(muteMode ? "ACTIVÉ" : "DÉSACTIVÉ");        
      displayUnified(); // Mettre à jour l'affichage pour montrer/cacher "MutE"
    }        
    
    // Réinitialiser le flag de clic long quand on relâche        
    button3LongPress = false;        
  }        
  
  // Détecter le clic long pendant qu'on maintient le bouton        
  if (button3State && (millis() - button3PressStartTime >= LONG_PRESS_DURATION) && !button3LongPress) {        
    button3LongPress = true;        
    Serial.println("Bouton 3 - Clic long : delay feedback MAX");        
  }        
  
  lastButtonStates[0] = button1State;        
  lastButtonStates[1] = button2State;        
  lastButtonStates[2] = button3State;        
}        
        
        
// Fonction pour gérer les boutons avec interruptions        
void handleButtonInterrupts() {        
  // Les boutons 1 et 2 sont maintenant gérés par polling dans handleButtons()
  // pour éviter les problèmes de debounce des interruptions
  
  // Traiter les interruptions du bouton 3 (gestion mute/delay feedback)        
  if (buttonInterruptFlags[2]) {        
    // Cette fonction est maintenant gérée dans handleButtons() pour le clic long
    buttonInterruptFlags[2] = false;        
  }        
}        
        
        
// Fonction pour gérer l'encodeur KY-040 - Système unifié web presets        
void handleEncoder() {        
  // *** NAVIGATION PAR ROTATION DÉSACTIVÉE ***
  // L'encodeur rotatif est défaillant et interfère avec la navigation par boutons
  // On garde seulement le bouton de l'encodeur pour charger les presets
  
  // int32_t currentEncoderValue = - encoder.getCount();        
  // int32_t normalizedValue = abs(currentEncoderValue / 2);        
  // uint8_t newWebPreset = (normalizedValue % 8) + 1; // 1-8        
  // if (newWebPreset != selectedWebPreset) {        
  //   selectedWebPreset = newWebPreset;        
  //   displayUnified();        
  //   Serial.print("🔄 Preset web sélectionné: P");        
  //   Serial.println(selectedWebPreset);        
  // }        
          
  // Gestion du bouton de l'encodeur (charger le preset sélectionné)        
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);        
  if (encoderButtonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {        
    // Charger le preset web sélectionné        
    loadWebPresetUnified(selectedWebPreset - 1); // Convertir 1-8 en 0-7        
            
    encoderButtonPressed = true;        
    lastEncoderButtonPress = millis();        
  }        
          
  if (!encoderButtonState) {        
    encoderButtonPressed = false;        
  }        
}        
        
// Fonction pour afficher l'octave et le preset web de manière unifiée        
void displayUnified() {        
  // Vérifier si on est en mode mute
  if (muteMode) {
    // Afficher "MutE"
    uint8_t muteSegments[4] = {
      0x54, // M
      0x1C, // u 
      0x78, // t
      0x79  // E
    };
    display.setSegments(muteSegments);
    return;
  }
          
  // Format unifié: OOPP où OO = octave (-12 à +12) et PP = preset web (P1-P8)        
  // Exemples:         
  // - Octave +5, preset 3 → " 5P3"         
  // - Octave -2, preset 7 → "-2P7"        
  // - Octave 0, preset 1 → " 0P1"        
          
  uint8_t segments[4] = {0, 0, 0, 0};        
          
  // Utiliser toujours l'octave web (système unifié)        
  int8_t displayValue = webOctave;        
          
  // Calcul pour les digits de l'octave (positions 0 et 1)        
  if (displayValue == 0) {        
    // Valeur = 0 : afficher " 0"        
    segments[0] = 0x00; // Espace        
    segments[1] = display.encodeDigit(0);        
  } else if (displayValue > 0) {        
    // Valeur positive : afficher directement le nombre        
    if (displayValue >= 10) {        
      segments[0] = display.encodeDigit(displayValue / 10);        
      segments[1] = display.encodeDigit(displayValue % 10);        
    } else {        
      segments[0] = 0x00; // Espace        
      segments[1] = display.encodeDigit(displayValue);        
    }        
  } else {        
    // Valeur négative : afficher "-" + valeur absolue        
    segments[0] = 0x40; // Segment "-"        
    int absValue = -displayValue;        
    segments[1] = display.encodeDigit(absValue);        
  }        
          
  // Calcul pour les digits du preset (positions 2 et 3)        
  segments[2] = 0x73; // Segment "P"        
  segments[3] = display.encodeDigit(selectedWebPreset);        
          
  // Afficher les segments        
  display.setSegments(segments);        
}        
        
// Fonction pour mettre à jour l'afficheur TM1637        
void updateDisplay() {        
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {        
    // Utiliser la nouvelle fonction d'affichage unifiée        
    displayUnified();        
    lastDisplayUpdate = millis();        
  }        
}        
        
// === FONCTIONS DE DÉMARRAGE SÉPARÉES ===

void setup_OTA() {
  Serial.println("=== MODE OTA ACTIVÉ ===");
  
  // Initialiser FastLED pour l'OTA
  FastLED.addLeds<WS2812B, LED_STRIP_PIN, GRB>(leds, NUM_LEDS);        
  FastLED.setBrightness(BRIGHTNESS);        
  
  // 5 clignottements bleus pour annoncer le début
  Serial.println("Pattern LED: 5 clignottements bleus");
  for (int i = 0; i < 5; i++) {
    for (int j = 0; j < NUM_LEDS; j++) {
      leds[j] = CRGB(0, 0, 255); // Bleu
    }
    FastLED.show();
    delay(200);
    FastLED.clear();
    FastLED.show();
    delay(200);
  }
  
  otaUpdate.beginOTA();        
  
  // Boucle OTA jusqu'à completion        
  while (!otaUpdate.isOTAComplete()) {        
    otaUpdate.updateOTA();        
    delay(100);        
  }        
  
  // 5 clignottements verts ou rouges selon le résultat
  Serial.println("Pattern LED: 5 clignottements verts/rouges");
  CRGB resultColor = CRGB(0, 255, 0); // Vert par défaut
  for (int i = 0; i < 5; i++) {
    for (int j = 0; j < NUM_LEDS; j++) {
      leds[j] = resultColor;
    }
    FastLED.show();
    delay(200);
    FastLED.clear();
    FastLED.show();
    delay(200);
  }
  
