gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Redémarrage après OTA        
  Serial.println("Redémarrage après mise à jour OTA...");        
  delay(2000);
  ESP.restart();
}

void setup_normal() {
  Serial.println("=== MODE NORMAL ACTIVÉ ===");
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques        
  btStop();        
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");        
          
  // Afficher l'adresse MAC de l'ESP32        
  Serial.print("Adresse MAC ESP32: ");        
  Serial.println(WiFi.macAddress());        
          
  // Initialisation du tableau DMX à 0        
  for (int i = 0; i < 512; i++) {        
    dmxValues[i] = 0;        
  }        
          
  // Initialisation des paramètres        
  initializeParameters();        
          
  // Initialisation des presets        
  initializePresets();        
          
  // Chargement du preset 1 au démarrage        
  loadPreset(1);        
  selectedPreset = 1; // S'assurer que selectedPreset est correct        
          
  // Initialisation de l'interface utilisateur        
  initializeUserInterface();        
          
  // Affichage initial unifié        
  displayUnified();        
          
  // Configuration ESP-NOW        
  WiFi.mode(WIFI_STA);        
          
  if (esp_now_init() != ESP_OK) {        
    Serial.println("Erreur d'initialisation ESP-NOW");        
    return;        
  }        
          
  // Configuration du callback de réception        
  // esp_now_register_recv_cb(OnDataRecv); // Pas nécessaire pour l'envoi seulement
        
  // Configuration du callback d'envoi        
  esp_now_register_send_cb(OnDataSent);        
          
  // Ajout du peer (récepteur ksoloti)        
  memcpy(peerInfo.peer_addr, receiverAddress, 6);        
  peerInfo.channel = 0;        
  peerInfo.encrypt = false;        
          
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {        
    Serial.println("Échec de l'ajout du peer");        
    return;        
  }        
          
  Serial.println("ESP-NOW configuré avec succès");        
          
  // Configuration du serveur web        
  setupWebInterface();        
          
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");        
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");        
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");        
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");        
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");        
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");        
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");        
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");        
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 3: Trig HH");        
  Serial.println("Bouton encodeur: Toggle filtre ON/OFF");        
        
  Serial.println("Transposition actuelle: " + String(transpose) + " (├ù" + String(transpose_factor) + ")");        
  Serial.println("Transposition appliquée au pitch et gate_threshold");        
  Serial.println("================================");        
}

// === MODE STANDALONE (SANS INTERFACE WEB) ===
void setup_standalone() {
  Serial.println("=== MODE STANDALONE ACTIVÉ ===");
  currentOperatingMode = MODE_STANDALONE;
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques        
  btStop();        
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");        
          
  // Afficher l'adresse MAC de l'ESP32        
  Serial.print("Adresse MAC ESP32: ");        
  Serial.println(WiFi.macAddress());        
          
  // FastLED déjà initialisé dans setup()        
          
  // Initialiser l'afficheur TM1637        
  display.setBrightness(7); // Luminosité maximale        
  Serial.println("Afficheur TM1637 initialisé");        
          
  // Initialiser l'encodeur rotatif        
  encoder.attachSingleEdge(ENCODER_A_PIN, ENCODER_B_PIN);        
  encoder.setCount(0);        
  Serial.println("Encodeur rotatif initialisé");        
          
  // Configuration des pins pour les boutons        
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);        
  pinMode(BUTTON_3_PIN, INPUT_PULLUP);        
  Serial.println("Boutons configurés");        
          
  // Initialiser ESP-NOW        
  WiFi.mode(WIFI_STA);        
  if (esp_now_init() != ESP_OK) {        
    Serial.println("Erreur lors de l'initialisation d'ESP-NOW");        
    return;        
  }        
          
  // Enregistrer la fonction de callback pour ESP-NOW        
  esp_now_register_send_cb(OnDataSent);        
          
  // Ajouter le peer (récepteur ksoloti)        
  memcpy(peerInfo.peer_addr, receiverAddress, 6);        
  peerInfo.channel = 0;        
  peerInfo.encrypt = false;        
          
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {        
    Serial.println("Erreur lors de l'ajout du peer");        
    return;        
  }        
          
  Serial.println("ESP-NOW initialisé avec succès");        
          
  // Initialiser les paramètres par défaut        
  initializeParameters();        
          
  // Initialiser les presets        
  initializePresets();        
          
  // Initialiser l'interface utilisateur        
  initializeUserInterface();        
          
  // Initialiser le système unifié des presets web        
  webModeActive = true;        
  selectedPreset = 0; // Toujours en mode web        
  selectedWebPreset = 1; // Commencer avec P1 sélectionné        
  displayUnified(); // Afficher l'état initial        
          
  Serial.println("🎯 Système unifié activé - Utilisation exclusive des web presets");        
  Serial.print("🎵 Octave actuelle: ");        
  Serial.println(webOctave);        
  Serial.print("📋 Preset sélectionné: P");        
  Serial.println(selectedWebPreset);        
          
  // IMPORTANT: Charger le preset P1 par défaut au démarrage
  loadWebPresetUnified(0); // Charger P1 (index 0)
  Serial.println("🚀 Preset P1 chargé par défaut");
          
  // Initialiser LittleFS pour charger les presets web (même en mode standalone)
  Serial.println("Initialisation de LittleFS...");        
  if (!LittleFS.begin(true)) {        
    Serial.println("Première tentative échouée, formatage forcé...");        
    LittleFS.format();        
    if (!LittleFS.begin(true)) {        
      Serial.println("Erreur: Impossible d'initialiser LittleFS même après formatage");        
      // Initialiser des presets par défaut si LittleFS échoue
      initializeEmptyWebPresets();
    } else {
      Serial.println("LittleFS initialisé avec succès");        
      // Charger les presets web existants
      loadWebPresets();
      // Initialiser des presets vides si aucun preset n'existe
      if (webPresetCount == 0) {
        Serial.println("Aucun preset trouvé - Initialisation des presets vides...");
        initializeEmptyWebPresets();
      }
    }        
  } else {
    Serial.println("LittleFS initialisé avec succès");        
    // Charger les presets web existants
    loadWebPresets();
    // Initialiser des presets vides si aucun preset n'existe
    if (webPresetCount == 0) {
      Serial.println("Aucun preset trouvé - Initialisation des presets vides...");
      initializeEmptyWebPresets();
    }
  }
  
  // Maintenant recharger le preset P1 (il devrait exister)
  loadWebPresetUnified(0); // Charger P1 (index 0)
  Serial.println("🚀 Preset P1 rechargé après initialisation LittleFS");
          
  // Indicateur LED déjà géré dans setup()
          
