gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Enregistrer la fonction de callback pour ESP-NOW        
  esp_now_register_send_cb(OnDataSent);        
          
  // Ajouter le peer (récepteur ksoloti)        
  memcpy(peerInfo.peer_addr, receiverAddress, 6);        
  peerInfo.channel = 0;        
  peerInfo.encrypt = false;        
          
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {        
    Serial.println("Erreur lors de l'ajout du peer");        
    return;        
  }        
          
  Serial.println("ESP-NOW initialisé avec succès");        
          
  // Initialiser les paramètres par défaut        
  initializeParameters();        
          
  // Initialiser les presets        
  initializePresets();        
          
  // Initialiser l'interface utilisateur        
  initializeUserInterface();        
          
  // Initialiser le système unifié des presets web        
  webModeActive = true;        
  selectedPreset = 0; // Toujours en mode web        
  selectedWebPreset = 1; // Commencer avec P1 sélectionné        
  displayUnified(); // Afficher l'état initial        
          
  Serial.println("🎯 Système unifié activé - Utilisation exclusive des web presets");        
  Serial.print("🎵 Octave actuelle: ");        
  Serial.println(webOctave);        
  Serial.print("📋 Preset sélectionné: P");        
  Serial.println(selectedWebPreset);      
    
          
  // Configuration du serveur web (WiFi ESP - Point d'accès)
  // IMPORTANT: doit être avant loadWebPresetUnified pour que les presets LittleFS soient en mémoire
  setupWebInterfaceESP();

  // Charger le preset P1 par défaut APRÈS le chargement depuis LittleFS
  loadWebPresetUnified(0);
  Serial.println("🚀 Preset P1 chargé (depuis LittleFS)");        
          
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");        
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");        
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");        
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");        
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");        
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");        
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");        
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");        
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 3: Mute/Unmute (clic court) ou changement de preset (clic long)");        
  Serial.println("Encodeur: Changer preset (rotation) ou octave (clic)");        
  Serial.println("Ruban LED: Feedback visuel des capteurs IR et faders");        
          
  Serial.println("=== MODE WIFI ESP INITIALISÉ ===");        
  Serial.println("Interface web: ACTIVÉE (Point d'accès ESP)");        
  Serial.println("ESP-NOW: ACTIVÉ");        
  Serial.println("Le système est prêt à fonctionner en mode WiFi ESP");        
}

void setup()        
{        
  Serial.begin(115200);        
  Serial.println("=== Contrôleur Interactif ESP32 ===");        
  Serial.print("Version: ");
  Serial.println(VERSION);
  Serial.println("Initialisation...");        
          
  // === VÉRIFICATION DU MODE DE DÉMARRAGE ===        
  Serial.println("Vérification du mode de démarrage...");        
  
  // Configuration des boutons
  pinMode(BUTTON_1_PIN, INPUT_PULLUP); // GPIO22 - OTA
  pinMode(BUTTON_2_PIN, INPUT_PULLUP); // GPIO21 - réservé
  delay(100); // Attendre la stabilisation

  // Initialiser FastLED pour les indicateurs de mode
  FastLED.addLeds<WS2812B, LED_STRIP_PIN, GRB>(leds, NUM_LEDS);
  FastLED.setBrightness(BRIGHTNESS);

  // Bouton 1 pressé au démarrage → Mode OTA
  bool button1Pressed = !digitalRead(BUTTON_1_PIN);
  Serial.print("État du bouton 1 au démarrage: ");
  Serial.println(button1Pressed ? "PRESSÉ" : "RELAXÉ");

  if (button1Pressed) {
    setup_OTA(); // Cette fonction termine par un redémarrage
    return;
  }

  // Mode par défaut : Point d'accès WiFi (AP)
  Serial.println("Démarrage en mode WiFi AP (point d'accès)");
  addDebugMessage("Démarrage mode WiFi AP");
  setup_wifi_esp();
  return;
}        
        
void sendDMXvalues()        
{        
  // Appliquer les overrides avant l'envoi
  uint8_t originalMasterVolume = dmxValues[119]; // Canal DMX 120 (master_volume)
  uint8_t originalDelayFeedback = dmxValues[105]; // Canal DMX 106 (delay_feedback)
  
  // Override du master volume en mode mute (255 = mute car volume inversé)
  if (muteMode) {
    dmxValues[119] = 255;
  }
  
  // Override du delay feedback en clic long (255 = maximum)
  if (button3LongPress) {
    dmxValues[105] = 255;
  }
        
  // Envoi des 4 paquets DMX (512 canaux divisés en 4 blocs de 128)        
  for (int packetNumber = 0; packetNumber < 4; packetNumber++)        
  {        
    outgoingDMXPacket.blockNumber = packetNumber;        
            
    // Remplir le paquet avec les 128 valeurs correspondantes        
    for (int i = 0; i < 128; i++)        
    {        
      int dmxIndex = (packetNumber * 128) + i;        
      if (dmxIndex < 512) {        
        outgoingDMXPacket.dmxvalues[i] = dmxValues[dmxIndex];        
      } else {        
        outgoingDMXPacket.dmxvalues[i] = 0;        
      }        
    }        
            
    // Envoi du paquet via ESP-NOW        
    esp_err_t result = esp_now_send(receiverAddress, (uint8_t *)&outgoingDMXPacket, sizeof(outgoingDMXPacket));        
            
    // ESP-NOW send errors are expected when receiver is not available
    (void)result;        
  }        
          
  // Restaurer les valeurs originales après l'envoi (pour ne pas affecter les paramètres stockés)
  dmxValues[119] = originalMasterVolume;  // Restaurer master_volume
  dmxValues[105] = originalDelayFeedback;  // Restaurer delay_feedback
          
  // Décrémenter les canaux trig_kick, trig_snare et trig_hh après l'envoi        
  if (dmxValues[116] > 0) dmxValues[116]--; // Canal DMX 117 (trig_kick)        
  if (dmxValues[117] > 0) dmxValues[117]--; // Canal DMX 118 (trig_snare)        
  if (dmxValues[118] > 0) dmxValues[118]--; // Canal DMX 119 (trig_hh)        
          
  //Serial.println();        
}        
        
