gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
void setlights()        
{        
  // Canal DMX 1 : Mode de contrôle (0 = intensité rouge, 1 = autre mode, etc.)        
  dmxValues[0] = 0; // Mode intensité rouge        
          
  // Canaux DMX 2, 3, 4 : RGB1 dimmé par IR1        
  dmxValues[1] = rgb1RedDimmed;    // Canal DMX 2 (R)        
  dmxValues[2] = rgb1GreenDimmed;  // Canal DMX 3 (G)         
  dmxValues[3] = rgb1BlueDimmed;   // Canal DMX 4 (B)        
          
  // Mise à jour du ruban WS2812B avec RGB2 dimmé par IR2        
  for (int i = 0; i < NUM_LEDS; i++) {        
    leds[i] = CRGB(rgb2RedDimmed, rgb2GreenDimmed, rgb2BlueDimmed);        
  }        
          
  // Mettre à jour l'affichage        
  FastLED.show();        
}        
        
void testInputs() {        
  // Affichage compact des valeurs brutes        
          
  // Lecture des capteurs Sharp IR (valeurs brutes 0-4095)        
  int irRaw1 = analogRead(DIST_SENSOR_1_PIN);        
  int irRaw2 = analogRead(DIST_SENSOR_2_PIN);        
          
  // Lecture des faders (valeurs brutes 0-4095)        
  int fader1Raw = analogRead(FADER_1_PIN);        
  int fader2Raw = analogRead(FADER_2_PIN);        
  int fader3Raw = analogRead(FADER_3_PIN);        
          
  // Lecture des boutons (0 ou 1)        
  bool button1State = !digitalRead(BUTTON_1_PIN); // Bouton 1 sur GPIO22        
  bool button2State = !digitalRead(BUTTON_2_PIN); // Bouton 2 sur GPIO21        
  bool button3State = !digitalRead(BUTTON_3_PIN);        
          
  // Lecture de l'encodeur        
  int32_t testEncoderValue = encoder.getCount();        
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);        
          
  // Mapper les faders sur 0-255 pour DMX 2, 3, 4 (inversés)        
  uint8_t fader1Mapped = (4095 - fader1Raw) / 16; // 4095-0 à 0-255        
  uint8_t fader2Mapped = (4095 - fader2Raw) / 16;        
  uint8_t fader3Mapped = (4095 - fader3Raw) / 16;        
          
  // Assigner aux canaux DMX 2, 3, 4        
  dmxValues[1] = fader1Mapped; // DMX 2 (Rouge)        
  dmxValues[2] = fader2Mapped; // DMX 3 (Vert)        
  dmxValues[3] = fader3Mapped; // DMX 4 (Bleu)        
          
  // Affichage compact sur une ligne        
  Serial.print("IR1 ");        
  Serial.print(irRaw1);        
  Serial.print(" | IR2 ");        
  Serial.print(irRaw2);        
  Serial.print(" | F1 ");        
  Serial.print(fader1Raw);        
  Serial.print(" | F2 ");        
  Serial.print(fader2Raw);        
  Serial.print(" | F3 ");        
  Serial.print(fader3Raw);        
  Serial.print(" | B1 ");        
  Serial.print(button1State ? "1" : "0");        
  Serial.print(" | B2 ");        
  Serial.print(button2State ? "1" : "0");        
  Serial.print(" | B3 ");        
  Serial.print(button3State ? "1" : "0");        
  Serial.print(" | ENC ");        
  Serial.print(testEncoderValue);        
  Serial.print(" | ENCB ");        
  Serial.print(encoderButtonState ? "1" : "0");        
  Serial.print(" | DMX2 ");        
  Serial.print(dmxValues[1]);        
  Serial.print(" | DMX3 ");        
  Serial.print(dmxValues[2]);        
  Serial.print(" | DMX4 ");        
  Serial.print(dmxValues[3]);        
  Serial.println();        
          
  // En mode test, afficher l'encodeur sur les 4 digits        
  display.clear();        
  uint16_t displayValue = abs(testEncoderValue) % 10000; // Limiter à 4 chiffres        
  display.showNumberDec(displayValue);        
          
  // Mettre à jour le LED strip avec les valeurs DMX 2, 3, 4        
  uint8_t redValue = dmxValues[1];    // Canal DMX 2 (R)        
  uint8_t greenValue = dmxValues[2];  // Canal DMX 3 (G)         
  uint8_t blueValue = dmxValues[3];   // Canal DMX 4 (B)        
          
  // Appliquer la couleur RGB à tous les LEDs du ruban        
  for (int i = 0; i < NUM_LEDS; i++) {        
    leds[i] = CRGB(redValue, greenValue, blueValue);        
  }        
          
  // Mettre à jour l'affichage        
  FastLED.show();        
}        
        
        
        
          
        
          
        
        
void loop()        
{        
  // Incrémenter le compteur d'affichage        
  displayCounter++;        
          
  if (CONTROL_TEST == 1) {        
    // affichage des valeurs brutes des capteurs, boutons, faders, encodeur        
    testInputs();        
    delay(500);        
  }        
  else // fonctionnement normal        
  {        
    // Gestion des contrôles physiques dynamiques (IR1, IR2, faders, bouton3)        
    handlePhysicalControls();        
            
    // Gestion de l'encodeur rotatif        
    handleEncoder();        
  }        
          
  // Lecture des faders        
 // readFaders();        
          
  // Gestion des boutons push        
  handleButtonInterrupts();
  handleButtons();  // Gestion du bouton 3 (mute/unmute et clic long)
          
  // Gestion du serveur web (limité à 10Hz pour éviter la surcharge)        
  // Seulement si l'interface web est activée (modes WiFi Local ou WiFi ESP)
  if (currentOperatingMode != MODE_STANDALONE) {
    static unsigned long lastWebServerUpdate = 0;        
    if (millis() - lastWebServerUpdate >= 100) { // 100ms = 10Hz        
      webServer.handleClient();        
      lastWebServerUpdate = millis();        
    }        
  }        
          
  // Gestion de l'encodeur KY-040        
 // handleEncoder();        
          
  // Mise à jour de l'afficheur TM1637        
  updateDisplay();        
          
  // Émission à fréquence fixe (50Hz)
  if (millis() - lastEmissionTime >= EMISSION_INTERVAL) {        
            
    setlights();        
    sendDMXvalues();        
    lastEmissionTime = millis();        
  }

  // Debug contrôles toutes les 2 secondes
  static unsigned long lastControlDebug = 0;
  if (millis() - lastControlDebug >= 2000) {
    int ir1Raw = analogRead(DIST_SENSOR_1_PIN);
    int ir2Raw = analogRead(DIST_SENSOR_2_PIN);
    int f1Raw  = analogRead(FADER_1_PIN);
    int f2Raw  = analogRead(FADER_2_PIN);
    int f3Raw  = analogRead(FADER_3_PIN);
    bool b1    = !digitalRead(BUTTON_1_PIN);
    bool b2    = !digitalRead(BUTTON_2_PIN);
    bool b3    = !digitalRead(BUTTON_3_PIN);
    Serial.println("=== CONTROLES ===");
    Serial.printf("  IR1  (GPIO%d): %4d -> DMX %3d\n", DIST_SENSOR_1_PIN, ir1Raw, ir1Raw / 16);
    Serial.printf("  IR2  (GPIO%d): %4d -> DMX %3d\n", DIST_SENSOR_2_PIN, ir2Raw, ir2Raw / 16);
    Serial.printf("  Fad1 (GPIO%d): %4d -> DMX %3d\n", FADER_1_PIN, f1Raw, f1Raw / 16);
    Serial.printf("  Fad2 (GPIO%d): %4d -> DMX %3d\n", FADER_2_PIN, f2Raw, f2Raw / 16);
    Serial.printf("  Fad3 (GPIO%d): %4d -> DMX %3d\n", FADER_3_PIN, f3Raw, f3Raw / 16);
    Serial.printf("  Btn1 (GPIO%d): %s\n", BUTTON_1_PIN, b1 ? "APPUYE" : "releve");
    Serial.printf("  Btn2 (GPIO%d): %s\n", BUTTON_2_PIN, b2 ? "APPUYE" : "releve");
    Serial.printf("  Btn3 (GPIO%d): %s\n", BUTTON_3_PIN, b3 ? "APPUYE" : "releve");
    Serial.println("=================");
    lastControlDebug = millis();
  }

  delay(1); // Petit délai pour éviter de surcharger le CPU
}        
        
// ============================================================================        
// IMPLÉMENTATION DES FONCTIONS DE L'INTERFACE WEB        
// ============================================================================        
        
// Initialisation du système de fichiers et du serveur web        
void setupWebInterface() {        
  // Initialiser le système de fichiers avec formatage forcé si nécessaire        
  Serial.println("Initialisation de LittleFS...");        
  if (!LittleFS.begin(true)) {        
    Serial.println("Première tentative échouée, formatage forcé...");        
    LittleFS.format();        
    if (!LittleFS.begin(true)) {        
      Serial.println("Erreur: Impossible d'initialiser LittleFS même après formatage");        
      return;        
    }        
  }        
  Serial.println("LittleFS initialisé avec succès");        
          
  // Vérifier que l'écriture fonctionne en créant un fichier de test        
  File testFile = LittleFS.open("/test.txt", "w");        
  if (testFile) {        
    testFile.println("Test d'écriture LittleFS");        
    testFile.close();        
    Serial.println("Test d'écriture LittleFS réussi");        
    LittleFS.remove("/test.txt"); // Nettoyer le fichier de test        
  } else {        
    Serial.println(" Erreur: Impossible d'écrire dans LittleFS");        
  }        
          
  // Lister les fichiers disponibles        
  File root = LittleFS.open("/");        
  File file = root.openNextFile();        
  Serial.println(" Fichiers disponibles dans LittleFS:");        
  while (file) {        
    Serial.print("  - ");        
    Serial.print(file.name());        
    Serial.print(" (");        
    Serial.print(file.size());        
    Serial.println(" bytes)");        
    file = root.openNextFile();        
  }        
          
