gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Configuration WiFiManager
  Serial.println("Configuration WiFiManager...");
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT_MS / 1000); // Convertir en secondes
  wifiManager.setAPCallback([](WiFiManager *myWiFiManager) {
    Serial.println("Portail de configuration WiFi démarré");
    Serial.print("SSID: ");
    Serial.println(myWiFiManager->getConfigPortalSSID());
    Serial.print("IP: ");
    Serial.println(WiFi.softAPIP());
  });
  
  // Tentative de connexion au WiFi
  Serial.println("Tentative de connexion au WiFi...");
  if (!wifiManager.autoConnect("KsolotiKontrol-Config")) {
    Serial.println("Échec de la connexion WiFi et timeout du portail de configuration");
    Serial.println("Redémarrage de l'ESP32...");
    delay(3000);
    ESP.restart();
  }
  
  // Connexion WiFi réussie
  Serial.println("Connexion WiFi établie !");
  Serial.print("SSID: ");
  Serial.println(WiFi.SSID());
  Serial.print("Adresse IP: ");
  Serial.println(WiFi.localIP());
  Serial.print("Adresse MAC: ");
  Serial.println(WiFi.macAddress());
  
  // Configurer les routes du serveur web
  setupWebRoutes();        
          
  // Démarrer le serveur web        
  webServer.begin();        
  Serial.println("Serveur web démarré");        
          
  // Initialiser les tableaux de presets web        
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    webPresets[i].name[0] = '\0'; // Marquer les slots comme vides        
    webPresets[i].octave = 0;     // Initialiser l'octave à 0        
  }        
          
  // Charger les presets web et assignations        
  Serial.println("Début du chargement des presets web...");        
  loadWebPresets();
  
  // Initialiser les presets vides si aucun preset n'existe
  if (webPresetCount == 0) {
    Serial.println("Aucun preset trouvé - Initialisation des presets vides...");
    initializeEmptyWebPresets();
  }
  
  Serial.println("Début du chargement des assignations web...");        
  loadWebAssignments();        
}        

// Initialisation du système de fichiers et du serveur web (Mode Point d'accès ESP)
void setupWebInterfaceESP() {        
  // Initialiser le système de fichiers avec formatage forcé si nécessaire        
  Serial.println("Initialisation de LittleFS...");        
  if (!LittleFS.begin(true)) {        
    Serial.println("Première tentative échouée, formatage forcé...");        
    LittleFS.format();        
    if (!LittleFS.begin(true)) {        
      Serial.println("Erreur: Impossible d'initialiser LittleFS même après formatage");        
      return;        
    }        
  }        
  Serial.println("LittleFS initialisé avec succès");        
          
  // Vérifier que l'écriture fonctionne en créant un fichier de test        
  File testFile = LittleFS.open("/test.txt", "w");        
  if (testFile) {        
    testFile.println("Test d'écriture LittleFS");        
    testFile.close();        
    Serial.println("Test d'écriture LittleFS réussi");        
    LittleFS.remove("/test.txt"); // Nettoyer le fichier de test        
  } else {        
    Serial.println(" Erreur: Impossible d'écrire dans LittleFS");        
  }        
          
  // Lister les fichiers disponibles        
  File root = LittleFS.open("/");        
  File file = root.openNextFile();        
  Serial.println(" Fichiers disponibles dans LittleFS:");        
  while (file) {        
    Serial.print("  - ");        
    Serial.print(file.name());        
    Serial.print(" (");        
    Serial.print(file.size());        
    Serial.println(" bytes)");        
    file = root.openNextFile();        
  }        
          
  // Configuration du point d'accès WiFi
  Serial.println("Configuration du point d'accès WiFi...");
  const char* apSSID = "KsolotiKontrol-AP";
  const char* apPassword = "ksoloti123";

  // IMPORTANT: passer en AP_STA pour garder STA (ESP-NOW) + activer AP
  WiFi.mode(WIFI_AP_STA);
  delay(100);

  // Créer le point d'accès
  bool apOk = WiFi.softAP(apSSID, apPassword, 6, 0, 4); // Canal 6, visible, max 4 clients
  delay(500); // laisser le temps à l'AP de s'initialiser
  Serial.print("softAP() = ");
  Serial.println(apOk ? "OK" : "ECHEC");

  // Appliquer les optimisations AP
  optimizeAPMode();

  // Obtenir l'adresse IP du point d'accès
  IPAddress apIP = WiFi.softAPIP();
  Serial.print("Point d'accès créé: ");
  Serial.println(apSSID);
  Serial.print("Adresse IP: ");
  Serial.println(apIP);
  Serial.print("Mot de passe: ");
  Serial.println(apPassword);
  Serial.println("Interface web: http://192.168.4.1");
          
  // Configurer les routes du serveur web        
  setupWebRoutes();        
          
  // Démarrer le serveur web        
  webServer.begin();        
  Serial.println("Serveur web démarré");        
          
  // Initialiser les tableaux de presets web        
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    webPresets[i].name[0] = '\0'; // Marquer les slots comme vides        
    webPresets[i].octave = 0;     // Initialiser l'octave à 0        
  }        
          
  // Charger les presets web et assignations        
  Serial.println("Début du chargement des presets web...");        
  loadWebPresets();
  
  // Initialiser les presets vides si aucun preset n'existe
  if (webPresetCount == 0) {
    Serial.println("Aucun preset trouvé - Initialisation des presets vides...");
    initializeEmptyWebPresets();
  }
  
  Serial.println("Début du chargement des assignations web...");        
  loadWebAssignments();        
}        

// Optimisations pour le mode Access Point
void optimizeAPMode() {
  // Puissance WiFi maximale pour meilleure portée
  WiFi.setTxPower(WIFI_POWER_19_5dBm);
  
  // Réduire la latence TCP
  WiFi.setSleep(false);
  
  // Optimiser les paramètres TCP pour iPad
  WiFi.setAutoReconnect(true);
  
  // Configuration TCP pour éviter les connexions bloquées
  WiFi.onEvent([](WiFiEvent_t event, WiFiEventInfo_t info) {
    if (event == ARDUINO_EVENT_WIFI_AP_STADISCONNECTED) {
      Serial.println("🔌 Client déconnecté - Nettoyage connexions");
      // Forçage d'un garbage collection TCP
      delay(100);
    }
  });
  
  Serial.println("🚀 Optimisations mode AP appliquées (iPad compatible)");
}

