gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Configuration des routes du serveur web
void setupWebRoutes() {        
  // Route explicite pour la racine -> index.html
  webServer.on("/", HTTP_GET, []() {
    File file = LittleFS.open("/index.html", "r");
    if (file) {
      webServer.streamFile(file, "text/html");
      file.close();
    } else {
      webServer.send(404, "text/plain", "index.html not found");
    }
  });
          
  // Route de test simple (pour vérifier que le serveur fonctionne)        
  webServer.on("/test", HTTP_GET, []() {        
    String html = "<!DOCTYPE html><html><body>";        
    html += "<h1>Test DMX Controller</h1>";        
    html += "<p>Le serveur web fonctionne !</p>";        
    html += "<p>Fichiers LittleFS:</p><ul>";        
            
    File root = LittleFS.open("/");        
    File file = root.openNextFile();        
    while (file) {        
      html += "<li>" + String(file.name()) + " (" + String(file.size()) + " bytes)</li>";        
      file = root.openNextFile();        
    }        
    html += "</ul>";        
        
    html += "</body></html>";        
            
    webServer.send(200, "text/html", html);        
  });        
          
        
          
  // API pour récupérer les paramètres        
  webServer.on("/api/parameters", HTTP_GET, handleGetParameters);        
          
  // API pour mettre à jour un paramètre        
  webServer.on("/api/parameters", HTTP_POST, handleUpdateParameter);        
          
  // API pour récupérer les assignations        
  webServer.on("/api/assignments", HTTP_GET, handleGetAssignments);        
          
  // API pour mettre à jour les assignations        
  webServer.on("/api/assignments", HTTP_POST, handleUpdateAssignments);        
          
  // API pour sauvegarder un preset web        
  webServer.on("/api/save-preset", HTTP_POST, handleSaveWebPreset);        
          
  // API pour charger un preset web        
  webServer.on("/api/load-preset", HTTP_POST, handleLoadWebPreset);        
          
  // API pour lister les presets web        
  webServer.on("/api/presets", HTTP_GET, handleListWebPresets);        
          
  // API pour gérer les octaves        
  webServer.on("/api/octave", HTTP_POST, handleOctave);        
  
  // API pour exporter/importer les presets
  webServer.on("/api/export-presets", HTTP_GET, handleExportPresets);
  webServer.on("/api/import-presets", HTTP_POST, handleImportPresets);
  
  // API pour récupérer les messages de debug
  webServer.on("/api/debug", HTTP_GET, handleGetDebugMessages);
  
  // API pour changer le réseau WiFi
  webServer.on("/api/change-wifi", HTTP_POST, handleChangeWifi);
          
  // API pour vérifier les changements physiques - DÉSACTIVÉ (trop lourd)       
  // webServer.on("/api/status", HTTP_GET, handleGetStatus);        
          
  // Servir les fichiers statiques depuis LittleFS (APRÈS les APIs)        
  webServer.serveStatic("/", LittleFS, "/");        
          
  // Gestion des erreurs 404        
  webServer.onNotFound(handleNotFound);        
}        

// === FONCTIONS DE DEBUG WEB ===

// Fonction pour ajouter un message de debug
void addDebugMessage(String message) {
  // Ajouter un timestamp
  String timestamp = String(millis());
  String fullMessage = "[" + timestamp + "] " + message + "\n";
  
  // Ajouter le message au buffer
  debugMessages += fullMessage;
  
  // Limiter le nombre de messages pour éviter la surcharge mémoire
  int lineCount = 0;
  for (int i = 0; i < debugMessages.length(); i++) {
    if (debugMessages.charAt(i) == '\n') lineCount++;
  }
  
  // Si trop de messages, supprimer les plus anciens
  if (lineCount > MAX_DEBUG_MESSAGES) {
    int firstNewline = debugMessages.indexOf('\n');
    if (firstNewline != -1) {
      debugMessages = debugMessages.substring(firstNewline + 1);
    }
  }
}

// API pour récupérer les messages de debug
void handleGetDebugMessages() {
  DynamicJsonDocument doc(4096);
  doc["messages"] = debugMessages;
  doc["count"] = debugMessages.length();
  
  String response;
  serializeJson(doc, response);
  webServer.send(200, "application/json", response);
}        

// API: Changer le réseau WiFi
void handleChangeWifi() {
  // Vérifier qu'on est en mode WiFi local (pas en mode AP)
  if (currentOperatingMode != MODE_WIFI_LOCAL) {
    DynamicJsonDocument response(128);
    response["success"] = false;
    response["message"] = "Changement WiFi disponible uniquement en mode WiFi local";
    
    String jsonResponse;
    serializeJson(response, jsonResponse);
    webServer.send(400, "application/json", jsonResponse);
    return;
  }
  
  // Démarrer le portail de configuration WiFi
  Serial.println("🔄 Démarrage du portail de configuration WiFi...");
  
  DynamicJsonDocument response(128);
  response["success"] = true;
  response["message"] = "Portail WiFi lancé";
  
  String jsonResponse;
  serializeJson(response, jsonResponse);
  webServer.send(200, "application/json", jsonResponse);
  
  // Démarrer le portail de configuration (non-bloquant)
  delay(100); // Laisser le temps à la réponse d'être envoyée
  wifiManager.startConfigPortal("KsolotiKontrol-Config");
}
        
// API: Récupérer le statut système        
void handleGetStatus() {        
  Serial.println("DEBUG: handleGetStatus() appelée");        
  DynamicJsonDocument doc(512);        
  doc["lastPhysicalPresetChange"] = lastPhysicalPresetChange;        
  doc["selectedWebPreset"] = selectedWebPreset;        
  doc["webOctave"] = webOctave;        
  doc["lastWebPreset"] = lastWebPreset;        
          
  String response;        
  serializeJson(doc, response);        
  Serial.println("DEBUG: Status response: " + response);        
  webServer.send(200, "application/json", response);        
}        
        
// API: Récupérer les paramètres        
void handleGetParameters() {        
  Serial.println("DEBUG: GET /api/parameters - Début");        
          
  DynamicJsonDocument doc(1024);        
  JsonArray paramsArray = doc.createNestedArray("parameters");        
          
