gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// API: Charger un preset web        
void handleLoadWebPreset() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    int id = doc["id"];        
            
    // Vérifier que le slot existe et contient des données (on ignore webPresetCount)       
    if (id >= 0 && id < MAX_WEB_PRESETS && strlen(webPresets[id].name) > 0) {        
      // Debug: Chargement preset P" + String(id + 1)
      // Appliquer les valeurs du preset        
      for (int i = 0; i < 27; i++) {        
        parameters[i].value = webPresets[id].values[i];        
        dmxValues[parameters[i].dmxChannel - 1] = webPresets[id].values[i];        
      }        
              
      // Charger l'octave du preset        
      webOctave = webPresets[id].octave;        
              
      // Charger les assignations physiques du preset        
      for (int i = 0; i < 4; i++) {        
        webAssignments[i] = webPresets[id].assignments[i];        
      }        
              
      // Sauvegarder les assignations web mises à jour        
      saveWebAssignments();        
              
      // Appliquer l'octave aux paramètres sensibles        
      applyWebOctave();        
              
      // Mettre à jour l'affichage de l'octave        
      displayUnified();        
              
      lastWebPreset = id;        
              
      // Sauvegarder l'état dans le preset 0 pour persistance        
      saveWebStateToPreset0();        
              
      DynamicJsonDocument response(1024);        
      response["success"] = true;        
      response["message"] = "Preset chargé";        
              
      // Retourner les vraies valeurs des presets web (pas des paramètres actuels)        
      JsonArray paramsArray = response.createNestedArray("parameters");        
      for (int i = 0; i < 27; i++) {        
        paramsArray.add(webPresets[id].values[i]);        
      }        
              
      // Ajouter l'octave du preset chargé        
      response["octave"] = webPresets[id].octave;        
              
      // Ajouter les assignations du preset chargé        
      JsonArray assignmentsArray = response.createNestedArray("assignments");        
      for (int i = 0; i < 4; i++) {        
        assignmentsArray.add(webPresets[id].assignments[i]);        
      }        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Preset non trouvé ou slot vide\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Lister les presets web        
void handleListWebPresets() {        
  DynamicJsonDocument doc(2048);        
  JsonArray presetsArray = doc.createNestedArray("presets");        
          
  // Parcourir TOUS les slots (0-7) et vérifier lesquels ont un nom
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    if (strlen(webPresets[i].name) > 0) {  // Seulement les presets avec un nom
      JsonObject preset = presetsArray.createNestedObject();        
      preset["name"] = webPresets[i].name;        
      preset["id"] = i;        
    }
  }        
          
  String response;        
  serializeJson(doc, response);        
  webServer.send(200, "application/json", response);        
}        
        

// API: Gérer les octaves        
void handleOctave() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    String direction = doc["direction"];        
            
    if (direction == "up" && webOctave < 12) {        
      webOctave++;        
    } else if (direction == "down" && webOctave > -12) {        
      webOctave--;        
    }        
            
    // Appliquer l'octave web directement (système séparé)        
    applyWebOctave();        
            
    // Afficher l'octave sur l'écran (utiliser webOctave au lieu de transpose)        
    if (selectedPreset == 0 && webModeActive) {        
      displayUnified();        
              
      Serial.print("🎵 Octave web mise à jour: ");        
      Serial.println(webOctave);        
    }        
            
    DynamicJsonDocument response(256);        
    response["success"] = true;        
    response["octave"] = webOctave;        
    response["message"] = "Octave mise à jour";        
            
    String responseStr;        
    serializeJson(response, responseStr);        
    webServer.send(200, "application/json", responseStr);        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// Gestion des erreurs 404        
void handleNotFound() {        
  String path = webServer.uri();        
  Serial.print(" 404 - Page non trouvée: ");        
  Serial.println(path);        
          
  // Vérifier si le fichier existe dans LittleFS et le servir        
  if (LittleFS.exists(path)) {        
    Serial.println("  ⚠️ Le fichier existe dans LittleFS, tentative de service...");        
    
    File file = LittleFS.open(path, "r");        
    if (file) {        
      // Déterminer le type MIME        
      String mimeType = "text/plain";        
      if (path.endsWith(".html")) mimeType = "text/html";        
      else if (path.endsWith(".css")) mimeType = "text/css";        
      else if (path.endsWith(".js")) mimeType = "application/javascript";        
      else if (path.endsWith(".json")) mimeType = "application/json";        
      else if (path.endsWith(".png")) mimeType = "image/png";        
      else if (path.endsWith(".jpg") || path.endsWith(".jpeg")) mimeType = "image/jpeg";        
          
      // Ajouter des en-têtes de cache pour améliorer les performances
      webServer.sendHeader("Cache-Control", "public, max-age=31536000"); // 1 an
      webServer.sendHeader("Connection", "close");
      
